#include <iostream>
using namespace std;
class metod_gaussa
{
public:
    float A (float m_1_1, float m_1_2, float m_1_3, float m_2_1, float m_2_2, float m_2_3, float m_3_1, float m_3_2, float m_3_3)
    {
        float a, b;
        a = (m_1_1 * m_2_2 * m_3_3) + (m_1_2 * m_2_3 * m_3_1) + (m_1_3 * m_2_1 * m_3_2);
        b = (m_1_3 * m_2_2 * m_3_1) + (m_1_2 * m_2_1 * m_3_3) + (m_1_1 * m_2_3 * m_3_2);
        return (a - b);
    }
};
int main()
{
    metod_gaussa obj_1;
    setlocale (LC_ALL, "Russian");
    float M[3][4], x, y, z, w;
    cout << "¬ведите 1 строку и 1 столбец матрицы = "; cin >> M[0][0];
    cout << "¬ведите 1 строку и 2 столбец матрицы = "; cin >> M[0][1];
    cout << "¬ведите 1 строку и 3 столбец матрицы = "; cin >> M[0][2];
    cout << "¬ведите 2 строку и 1 столбец матрицы = "; cin >> M[1][0];
    cout << "¬ведите 2 строку и 2 столбец матрицы = "; cin >> M[1][1];
    cout << "¬ведите 2 строку и 3 столбец матрицы = "; cin >> M[1][2];
    cout << "¬ведите 3 строку и 1 столбец матрицы = "; cin >> M[2][0];
    cout << "¬ведите 3 строку и 2 столбец матрицы = "; cin >> M[2][1];
    cout << "¬ведите 3 строку и 3 столбец матрицы = "; cin >> M[2][2];
    cout << "¬ведите ответ 1 строки = "; cin >> M[0][3];
    cout << "¬ведите ответ 2 строки = "; cin >> M[1][3];
    cout << "¬ведите ответ 3 строки = "; cin >> M[2][3];
    w = obj_1.A(M[0][0],M[0][1],M[0][2],M[1][0],M[1][1],M[1][2],M[2][0],M[2][1],M[2][2]);
    x = obj_1.A(M[0][3],M[0][1],M[0][2],M[1][3],M[1][1],M[1][2],M[2][3],M[2][1],M[2][2]) / w;
    y = obj_1.A(M[0][0],M[0][3],M[0][2],M[1][0],M[1][3],M[1][2],M[2][0],M[2][3],M[2][2]) / w;
    z = obj_1.A(M[0][0],M[0][1],M[0][3],M[1][0],M[1][1],M[1][3],M[2][0],M[2][1],M[2][3]) / w;
    cout << "W = " << w << endl;
    cout << "X = " << x << endl;
    cout << "Y = " << y << endl;
    cout << "Z = " << z << endl;
    return 0;
}
